# Parameters
nc: 80 # number of classes, default 80
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # FRFDet-T  (SFRCF(element-wise add))
  s: [0.50, 0.50, 1024] # FRFDet-S  (SFRCF(element-wise add))
  m: [0.50, 1.00, 512] # FRFDet-M   (SFRCF(element-wise add))
  l: [1.00, 1.00, 512] # FRFDet-L   (SFRCF(element-wise add))
  x: [0.50, 1.50, 512] # FRFDet-X   (SFRCF(element-wise add))

# FRFDet backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, IBS_D, [64, 3, 2]] # 0-P1/2
  - [-1, 1, IBS_D, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, IBS_D, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, IBS_D, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, IBS_D, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# FRFDet neck + head
head:
  - [-1, 1, IBS_U, [1024, 2]]
  - [[-1, 6], 1, SFRCFAdd, [[3, 5], 1, 'silu']] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, IBS_U, [512, 2]]
  - [[-1, 4], 1, SFRCFAdd, [[3, 3], 1, 'silu']] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)

  - [-1, 1, IBS_D, [256, 3, 2]]
  - [[-1, 13], 1, SFRCFAdd, [[3, 5], 1, 'silu']] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 19 (P4/16-medium)

  - [-1, 1, IBS_D, [512, 3, 2]]
  - [[-1, 10], 1, SFRCFAdd, [[3, 7], 1, 'silu']] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
