
# Parameters
nc: 20 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov10n.yaml' will call yolov10.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]

# YOLOv10 backbone + Conditional Pooling
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 1, 1]]
  - [-1, 1, ConditionalPoolingLayer, [2, 2, 0]] # 2-P3/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, ConditionalPoolingLayer, [2, 2, 0]] # 5-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, ConditionalPoolingLayer, [2, 2, 0]] # 8-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 1, 1]]
  - [-1, 1, ConditionalPoolingLayer, [2, 2, 0]] # 11-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 13
  - [-1, 1, PSA, [1024]] # 14

# YOLOv10.0n head + Conditional Pooling
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 17

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 20 (P3/8-small)

  - [-1, 1, ConditionalPoolingLayer, [2, 2, 0]]
  - [[-1, 17], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 23 (P4/16-medium)

  - [-1, 1, ConditionalPoolingLayer, [2, 2, 0]]
  - [[-1, 14], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2fCIB, [1024, True, True]] # 26 (P5/32-large)

  - [[20, 23, 26], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
